#Дано три словники, в яких ключами є малі букви латинського алфавіту, а значеннями - цілі числа. 
#Ключі у всіх словниках – різні, їх є по 3 в кожному словнику. 
#Об’єднайте всі три словники в один і виведіть його вміст. 
#Підказка. скористайтеся оператором **, що використовується для об’єднання довільної кількості словників (Python 3.5+).
dict1 = {'a': 1, 'b': 2, 'c': 3}
dict2 = {'d': 4, 'e': 5, 'f': 6}
dict3 = {'g': 7, 'h': 8, 'i': 9}
combined_dict = {**dict1, **dict2, **dict3}
print(combined_dict)


